       IDENTIFICATION DIVISION.
       PROGRAM-ID. write-output.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT F-OUTPUT
               ASSIGN TO 'output.dat'
               ACCESS MODE IS SEQUENTIAL
               ORGANIZATION IS LINE SEQUENTIAL
               FILE STATUS IS F-OUTPUT-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  F-OUTPUT
           RECORD CONTAINS 250 CHARACTERS
           RECORDING MODE IS F.

       01  REC-F-OUTPUT        PIC X(200).

       WORKING-STORAGE SECTION.
       01  WS-LINE             PIC X(250) VALUE SPACES.

       PROCEDURE DIVISION.
       3050-WRITE-FO-START.
           OPEN OUTPUT F-OUTPUT.
           PERFORM 7000-WRITE-HEADER-START
               THRU 7010-WRITE-HEADER-END.
           PERFORM 7020-WRITE-DETAIL-START THRU 7030-WRITE-DETAIL-END.
           PERFORM 7040-WRITE-FIN-START THRU 7050-WRITE-FIN-END.
           CLOSE F-OUTPUT.
       3050-WRITE-FO-END.
           GOBACK.
